/*!
\file lib.h
\brief Бібіиотечный файл

Це файл, який містить декларацію функції filter_arr.
*/

/**
Функція mul_matrix
 \param **a - масив першої матриці.
 \param **b - масив другої матриці.
 \param **c - масив матриці у яку ми запишиме результат.
 \param d - кількість строк у матриці з результатом.
 \param е - кількість стовпців у матриці з результатом.
 \param f - кількість стовпців першої матриці або кількість строк другої матриці.
 \return Повертає матрицю з результатами множення.
*/

void mul_matrix(float **a, float **b, float **c, unsigned int d, unsigned int e, unsigned int f);
